app/views/problems/index.html.erb


<% @events=Event.all  %>
---
SELECT "events".* FROM "events"

      <tr>
        <td><%= @events.where(id: problem.event_id)[0].title %></td>
---
SELECT "events".* FROM "events" WHERE "events"."id" = ?  [["id", 1]]