app/views/problems/show_comments.html.erb

SELECT "problem_comments".* FROM "problem_comments" WHERE "problem_comments"."problem_id" = ?  [["problem_id", 1]]
---

<% @problem.problem_comments.each do |comment| %>