app/views/problems/solva_lists.html.erb


<% @events = Event.all %>
---
SELECT "events".* FROM "events"