app/controllers/causalities_controller.rb

SELECT "causalities".* FROM "causalities"
---
  def index
    @causalities = Causality.all

INSERT INTO "causalities" ("src_id", "dst_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["src_id", 2], ["dst_id", 3], ["created_at", "2015-06-15 06:43:39.082664"], ["updated_at", "2015-06-15 06:43:39.082664"]]
---
  def create
    @causality = Causality.new(causality_params)

    respond_to do |format|
      if @causality.save

SELECT  "causalities".* FROM "causalities" WHERE "causalities"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_causality
      @causality = Causality.find(params[:id])