app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "aaa"], ["created_at", "2015-06-15 06:38:56.075419"], ["updated_at", "2015-06-15 06:38:56.075419"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "bbb"], ["updated_at", "2015-06-15 06:42:25.759525"], ["id", 2]]