app/controllers/problems_controller.rb

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def create
    @problem = Problem.new(problem_params)
    @problem.user_id = current_user.id

    respond_to do |format|
      if @problem.save
---
INSERT INTO "problems" ("event_id", "user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["event_id", 1], ["user_id", 1], ["title", "aaa"], ["content", "a3"], ["created_at", "2015-06-15 08:53:27.146855"], ["updated_at", "2015-06-15 08:53:27.146855"]]

    def set_problem
      @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]