app/controllers/problem_comments_controller.rb

SELECT "problem_comments".* FROM "problem_comments"
---
  def index
    @problem_comments = ProblemComment.all

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]
---
  def new_id
    @problem_comment = ProblemComment.new
    @problem = Problem.find(params[:id])

INSERT INTO "problem_comments" ("problem_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["problem_id", 1], ["content", "a"], ["created_at", "2015-06-16 06:30:31.290303"], ["updated_at", "2015-06-16 06:30:31.290303"]]
---
  def create
    @problem_comment = ProblemComment.new(problem_comment_params)

    respond_to do |format|
      if @problem_comment.save

UPDATE "problem_comments" SET "problem_id" = ?, "updated_at" = ? WHERE "problem_comments"."id" = ?  [["problem_id", 1], ["updated_at", "2015-06-16 08:12:21.037085"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @problem_comment.update(problem_comment_params)

DELETE FROM "problem_comments" WHERE "problem_comments"."id" = ?  [["id", 5]]
---
  def destroy
    @problem_comment.destroy

SELECT  "problem_comments".* FROM "problem_comments" WHERE "problem_comments"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_problem_comment
      @problem_comment = ProblemComment.find(params[:id])