app/controllers/solvabilities_controller.rb

SELECT "solvabilities".* FROM "solvabilities"
---
  def index
    @solvabilities = Solvability.all

INSERT INTO "solvabilities" ("src_id", "dst_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["src_id", 1], ["dst_id", 1], ["created_at", "2015-06-15 06:41:08.587266"], ["updated_at", "2015-06-15 06:41:08.587266"]]
---
  def create
    @solvability = Solvability.new(solvability_params)

    respond_to do |format|
      if @solvability.save

UPDATE "solvabilities" SET "dst_id" = ?, "updated_at" = ? WHERE "solvabilities"."id" = ?  [["dst_id", 2], ["updated_at", "2015-06-15 06:43:18.886952"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @solvability.update(solvability_params)

SELECT  "solvabilities".* FROM "solvabilities" WHERE "solvabilities"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_solvability
      @solvability = Solvability.find(params[:id])